verilog_defaults -push
verilog_defaults -add -defer
read_verilog /home/gwe/projets/github/litexOnColorlightLab004.clean/tt/pythondata-cpu-vexriscv/pythondata_cpu_vexriscv/verilog/VexRiscv_Min.v
read_verilog /home/gwe/projets/litex-notes/tests/build/gsd_orangecrab-yosys-nowidelut_True-yosys-abc9_True/gateware/gsd_orangecrab.v
verilog_defaults -pop
attrmap -tocase keep -imap keep="true" keep=1 -imap keep="false" keep=0 -remove keep=0

synth_ecp5 -nowidelut -abc9  -top gsd_orangecrab
write_json  gsd_orangecrab.json
