verilog_defaults -push
verilog_defaults -add -defer
read_verilog /home/gwe/projets/github/litexOnColorlightLab004.clean/tt/pythondata-cpu-vexriscv/pythondata_cpu_vexriscv/verilog/VexRiscv_Min.v
read_verilog /home/gwe/projets/litex-notes/tests/build/lattice_crosslink_nx_vip-toolchain_oxide-nextpnr-ignoreloops_True-nextpnr-seed_10/gateware/lattice_crosslink_nx_vip.v
verilog_defaults -pop
attrmap -tocase keep -imap keep="true" keep=1 -imap keep="false" keep=0 -remove keep=0

synth_nexus -flatten  -top lattice_crosslink_nx_vip
write_json  lattice_crosslink_nx_vip.json
