verilog_defaults -push
verilog_defaults -add -defer
read_verilog /home/gwe/projets/github/litexOnColorlightLab004.clean/tt/pythondata-cpu-vexriscv/pythondata_cpu_vexriscv/verilog/VexRiscv_Min.v
read_verilog /home/gwe/projets/litex-notes/tests/build/colorlight_i5-ecppack-bootaddr_16-ecppack-spimode_qspi-ecppack-freq_19.4-ecppack-compress_True/gateware/colorlight_i5.v
verilog_defaults -pop
attrmap -tocase keep -imap keep="true" keep=1 -imap keep="false" keep=0 -remove keep=0

synth_ecp5  -top colorlight_i5
write_json  colorlight_i5.json
