verilog_defaults -push
verilog_defaults -add -defer
read_verilog /home/gwe/projets/github/litexOnColorlightLab004.clean/tt/pythondata-cpu-vexriscv/pythondata_cpu_vexriscv/verilog/VexRiscv_Min.v
read_verilog /home/gwe/projets/litex-notes/tests/build/tinyfpga_bx-nextpnr-ignoreloops_True/gateware/tinyfpga_bx.v
verilog_defaults -pop
attrmap -tocase keep -imap keep="true" keep=1 -imap keep="false" keep=0 -remove keep=0

synth_ice40 -dsp -top tinyfpga_bx
write_json  tinyfpga_bx.json
